Repository: spart-final-team4/HowManySet
Catalog: HowManySet/Resources/Localizable/Localizable.xcstrings
Source language: en
Languages: ja, ko

# %@ ~ %@, 총 시간 %@, 총 운동시간 %@
source: %@ ~ %@, Total %@, Workout %@
ja: %@ ~ %@、合計%@、運動%@
ko: %@ ~ %@, 총 시간 %@, 총 운동시간 %@

# %@%@ * %d회
source: %@%@ * %d reps
ja: %@%@ × %d回
ko: %@%@ * %d회

# %d개의 운동
source: %d exercises
ja: %d個の運動
ko: %d개의 운동

# %d세트
source: %d sets
ja: %dセット
ko: %d세트

# %d세트 * %@%@ * 총 %d회
source: %d sets * %@%@ * total %d reps
ja: %dセット * %@%@ * 合計%d回
ko: %d세트 * %@%@ * 총 %d회

# %d종목
source: %d exercises
ja: %d種目
ko: %d종목

# %d회
source: %d reps
ja: %d回
ko: %d회

# + 세트 추가하기
source: + Add Set
ja: + セットを追加
ko: + 세트 추가하기

# +1분
source: +1 min
ja: +1分
ko: +1분

# +10초
source: +10 sec
ja: +10秒
ko: +10초

# +30초
source: +30 sec
ja: +30秒
ko: +30초

# 0은 입력할 수 없습니다.
source: 0 cannot be entered.
ja: 0は入力できません。
ko: 0은 입력할 수 없습니다.

# 0은 입력할 수 없어요.
source: 0 cannot be entered.
ja: 0は入力できません。
ko: 0은 입력할 수 없어요.

# Google로 로그인
source: Login with Google
ja: Googleでログイン
ko: Google로 로그인

# HowManySet문제 제보하기
source: Report a problem to HowManySet
ja: HowManySetの問題を報告する
ko: HowManySet문제 제보하기

# 개수
source: Reps
ja: 回数
ko: 개수

# 계정 삭제
source: Delete Account
ja: アカウント削除
ko: 계정 삭제

# 기록
source: Record
ja: 運動記録
ko: 기록

# 내 루틴에 맞게 직접 설정해보세요
source: Set it up to fit your own routine
ja: 自分のルーティンに合わせて設定しましょう
ko: 내 루틴에 맞게 직접 설정해보세요

# 네트워크 연결을 확인해 주세요.
source: Please check your network connection.
ja: ネットワーク接続を確認してください。
ko: 네트워크 연결을 확인해 주세요.

# 닉네임을 적어주세요
source: Please enter your nickname
ja: ニックネームを入力してください
ko: 닉네임을 적어주세요

# 다음
source: Next
ja: 次へ
ko: 다음

# 로그아웃
source: Log Out
ja: ログアウト
ko: 로그아웃

# 로그아웃 하시겠습니까?
source: Do you want to log out?
ja: ログアウトしますか？
ko: 로그아웃 하시겠습니까?

# 로그인 실패
source: Login failed
ja: ログインに失敗しました
ko: 로그인 실패

# 로그인 정보를 확인해 주세요.
source: Please check your login information.
ja: ログイン情報をご確認ください。
ko: 로그인 정보를 확인해 주세요.

# 루틴 리스트
source: Routine List
ja: ルーティンリスト
ko: 루틴 리스트

# 루틴 저장
source: Save Routine
ja: ルーティンを保存
ko: 루틴 저장

# 루틴명을 입력해주세요
source: Please enter the routine name
ja: ルーティン名を入力してください
ko: 루틴명을 입력해주세요

# 루틴이 삭제되었어요!
source: Routine deleted!
ja: ルーティンが削除されました！
ko: 루틴이 삭제되었어요!

# 메모
source: Memo
ja: メモ
ko: 메모

# 메모가 수정되었어요!
source: Memo updated!
ja: メモが修正されました！
ko: 메모가 수정되었어요!

# 메모를 입력해 주세요.
source: Please enter a memo.
ja: メモを入力してください。
ko: 메모를 입력해 주세요.

# 메모를 입력해주세요.
source: Please enter a memo.
ja: メモを入力してください。
ko: 메모를 입력해주세요.

# 메인
source: Home
ja: メイン
ko: 메인

# 메일 앱이 설치되어 있지 않습니다. 앱 설치 후 재시도 해주세요.
source: Mail app is not installed. Please install it and try again.
ja: メールアプリがインストールされていません。 インストール後に再試行してください。
ko: 메일 앱이 설치되어 있지 않습니다. 앱 설치 후 재시도 해주세요.

# 모든 운동을 완료하셨습니다!
source: All exercises completed!
ja: すべての運動が完了しました！
ko: 모든 운동을 완료하셨습니다!

# 목록 순서 변경
source: Change List Order
ja: リスト順序を変更
ko: 목록 순서 변경

# 무게
source: Weight
ja: 重さ
ko: 무게

# 문제 또는 건의사항을 여기에 작성해주세요.
source: Please write your issue or suggestion here.
ja: 問題やご要望はこちらにご記入ください。
ko: 문제 또는 건의사항을 여기에 작성해주세요.

# 물 한 잔으로 리프레시해보세요!
source: Refresh with a glass of water!
ja: 水を飲んでリフレッシュしましょう！
ko: 물 한 잔으로 리프레시해보세요!

# 물 한잔 챙겼다면, 클릭!
source: Click if you've had a glass of water!
ja: 水を飲んだらクリック！
ko: 물 한잔 챙겼다면, 클릭!

# 반복 수
source: Reps
ja: 回数
ko: 반복 수

# 버전 정보
source: Version Info
ja: バージョン情報
ko: 버전 정보

# 비회원
source: Guest
ja: ゲスト
ko: 비회원

source: 비회원으로 시작하기
ja: ゲストとして始める

# 빈 항목은 저장할 수 없어요.
source: Empty items cannot be saved.
ja: 空の項目は保存できません。
ko: 빈 항목은 저장할 수 없어요.

# 삭제
source: Delete
ja: 削除
ko: 삭제

# 새 루틴 구성
source: Create New Routine
ja: 新しいルーティン作成
ko: 새 루틴 구성

# 새 운동 추가
source: Add New Exercise
ja: 新しい運動を追加
ko: 새 운동 추가

# 선택 운동 삭제
source: Delete Selected Exercise
ja: 選択した運動を削除
ko: 선택 운동 삭제

# 선택한 운동이 삭제되었어요!
source: The selected exercise has been deleted!
ja: 選択した運動が削除されました！
ko: 선택한 운동이 삭제되었어요!

# 세트
source: Set
ja: セット
ko: 세트

# 세트 수
source: Sets
ja: セット数
ko: 세트 수

# 세트 수, 무게를 변경할 수 있어요
source: You can change set count and weight
ja: セット数や重さを変更できます
ko: 세트 수, 무게를 변경할 수 있어요

# 세트 완료
source: Set Complete
ja: セット完了
ko: 세트 완료

# 세트 완료 버튼
source: Set Complete Button
ja: セット完了ボタン
ko: 세트 완료 버튼

# 순 운동
source: Active Time
ja: 運動時間
ko: 순 운동

# 스킵
source: Skip
ja: スキップ
ko: 스킵

# 시작
source: Start
ja: 開始
ko: 시작

# 시작하기
source: Start
ja: 開始
ko: 시작하기

# 아직 추가된 운동이 없습니다.
source: No exercises added yet.
ja: まだ追加された運動がありません。
ko: 아직 추가된 운동이 없습니다.

# 알 수 없음
source: Unknown
ja: 不明
ko: 알 수 없음

# 알림 설정
source: Notification Settings
ja: 通知設定
ko: 알림 설정

# 알림은 설정 앱에서 변경할 수 있어요. 앱 설정으로 이동할까요?
source: You can change notifications in the Settings app. Go to app settings?
ja: 通知は設定アプリで変更できます。 アプリ設定に移動しますか？
ko: 알림은 설정 앱에서 변경할 수 있어요. 앱 설정으로 이동할까요?

# 앱 버전: %@
source: App Version: %@
ja: アプリのバージョン: %@
ko: 앱 버전: %@

# 언어 변경
source: Language Setting
ja: 言語の変更
ko: 언어 변경

# 언어는 설정 앱에서 변경할 수 있어요. 앱 설정으로 이동할까요?
source: You can change the language in the Settings app. Go to app settings?
ja: 言語は設定アプリで変更できます。 アプリ設定に移動しますか？
ko: 언어는 설정 앱에서 변경할 수 있어요. 앱 설정으로 이동할까요?

# 업데이트
source: Update
ja: アップデート
ko: 업데이트

# 업데이트 예정
source: Coming Soon
ja: 近日公開予定
ko: 업데이트 예정

# 예) 벤치프레스, 체스트 프레스
source: e.g. Bench Press, Chest Press
ja: 例）ベンチプレス、チェストプレス
ko: 예) 벤치프레스, 체스트 프레스

# 예) 상체 루틴, 2분할 (하체/어깨)
source: e.g. Upper Body Routine, 2-Split (Legs/Shoulders)
ja: 例）上半身ルーティン、2分割（下半身/肩）
ko: 예) 상체 루틴, 2분할 (하체/어깨)

# 오늘도 득근해요
source: Let's get stronger today!
ja: 今日も筋トレ頑張ろう！
ko: 오늘도 득근해요

# 오늘은 어떤 운동할까?
source: What workout today?
ja: 今日はどんな運動をしよう？
ko: 오늘은 어떤 운동할까?

# 오류
source: Error
ja: エラー
ko: 오류

# 운동 기록 저장됨
source: Workout record saved
ja: 運動記録が保存されました
ko: 운동 기록 저장됨

# 운동 기록이 삭제되었습니다!
source: Workout record deleted!
ja: 運動記録が削除されました！
ko: 운동 기록이 삭제되었습니다!

# 운동 목록 변경
source: Edit Exercise List
ja: 運動リストを変更
ko: 운동 목록 변경

# 운동 상세
source: Workout Details
ja: 運動詳細
ko: 운동 상세

# 운동 세트와 개수를 입력해주세요.
source: Please enter the workout sets and reps.
ja: 運動セットと回数を入力してください。
ko: 운동 세트와 개수를 입력해주세요.

# 운동 시작하기
source: Start Workout
ja: 運動を始める
ko: 운동 시작하기

# 운동 완료! 수고했어요
source: Workout complete! Great job!
ja: 運動完了！お疲れさまでした
ko: 운동 완료! 수고했어요

# 운동 이름
source: Exercise Name
ja: 運動名
ko: 운동 이름

# 운동 이름부터 세트 수까지
source: From exercise name to set count
ja: 運動名からセット数まで
ko: 운동 이름부터 세트 수까지

# 운동 이름을 입력해주세요.
source: Please enter the workout name.
ja: 運動名を入力してください。
ko: 운동 이름을 입력해주세요.

# 운동 이름이 너무 길어요.
source: The workout name is too long.
ja: 運動名が長すぎます。
ko: 운동 이름이 너무 길어요.

# 운동 이름이 너무 짧아요.
source: The workout name is too short.
ja: 運動名が短すぎます。
ko: 운동 이름이 너무 짧아요.

# 운동 정보 변경
source: Edit Exercise Info
ja: 運動情報を変更
ko: 운동 정보 변경

# 운동 종목
source: Exercises
ja: 種目数
ko: 운동 종목

# 운동 중 화면에서 무게, 횟수 클릭 시
source: Tap weight or reps during your workout
ja: 運動中の画面で重さや回数をタップすると
ko: 운동 중 화면에서 무게, 횟수 클릭 시

# 운동 중엔 앱을 꺼도 OK!
source: You can turn off the app during a workout!
ja: 運動中にアプリを閉じてもOK！
ko: 운동 중엔 앱을 꺼도 OK!

# 운동 추가
source: Add Exercise
ja: 運動を追加
ko: 운동 추가

# 운동명을 입력해주세요
source: Please enter the exercise name
ja: 運動名を入力してください
ko: 운동명을 입력해주세요

# 운동을 완료하면 세트 완료를 클릭하고,
source: When you finish, tap Set Complete,
ja: 運動が終わったら「セット完了」をクリックして
ko: 운동을 완료하면 세트 완료를 클릭하고,

# 운동이 추가되었어요!
source: Workout added!
ja: 運動が追加されました！
ko: 운동이 추가되었어요!

# 운동정보 입력
source: Enter Workout Info
ja: 運動情報入力
ko: 운동정보 입력

# 원하는 루틴만 골라 시작하세요
source: Pick only the routines you want and start
ja: 好きなルーティンだけを選んで始めましょう
ko: 원하는 루틴만 골라 시작하세요

# 유효하지 않은 닉네임입니다. (한글/영문/숫자 2~8자)
source: Invalid nickname. Use 2–8 characters: English letters, or numbers
ja: 無効なニックネームです。2〜8文字の日本語・英字・数字を使用してください
ko: 유효하지 않은 닉네임입니다. (한글/영문/숫자 2~8자)

# 이동
source: Go
ja: 移動
ko: 이동

# 이제 다음 세트를 시작하세요!
source: Start your next set now!
ja: 次のセットを始めましょう！
ko: 이제 다음 세트를 시작하세요!

# 일시적인 오류가 발생했습니다. 잠시 후 다시 시도해 주세요.
source: A temporary error occurred. Please try again later.
ja: 一時的なエラーが発生しました。 しばらくしてから再度お試しください。
ko: 일시적인 오류가 발생했습니다.\n잠시 후 다시 시도해 주세요.

# 입력
source: Input
ja: 入力
ko: 입력

# 잠금화면에서 운동 완료, 휴식까지 한 번에
source: Complete your workout and rest from the lock screen
ja: ロック画面で運動完了も休憩も一度に
ko: 잠금화면에서 운동 완료, 휴식까지 한 번에

# 저장
source: Save
ja: 保存
ko: 저장

# 저장되었어요!
source: Saved!
ja: 保存されました！
ko: 저장되었어요!

# 저장하기
source: Save
ja: 保存
ko: 저장하기

# 정말 탈퇴하시겠습니까?
source: Are you sure you want to delete your account?
ja: 本当に退会しますか？
ko: 정말 탈퇴하시겠습니까?

# 종목 수: %d
source: Exercises: %d
ja: 種目数: %d
ko: 종목 수: %d

# 초기화
source: Reset
ja: リセット
ko: 초기화

# 총 %d세트
source: Total %d sets
ja: 合計%dセット
ko: 총 %d세트

# 총 세트 수: %d
source: Total sets: %d
ja: 合計セット数: %d
ko: 총 세트 수: %d

# 총 시간
source: Total Time
ja: 総時間
ko: 총 시간

# 최신버전으로 업데이트 하시겠습니까? (업데이트 클릭 시 앱스토어로 연결됩니다.)
source: Would you like to update to the latest version? (Tap update to go to the App Store.)
ja: 最新版にアップデートしますか？ （アップデートをタップするとApp Storeに移動します）
ko: 최신버전으로 업데이트 하시겠습니까? (업데이트 클릭 시 앱스토어로 연결됩니다.)

# 최신버전이 아닙니다.
source: This is not the latest version.
ja: 最新版ではありません。
ko: 최신버전이 아닙니다.

# 취소
source: Cancel
ja: キャンセル
ko: 취소

# 카카오로 시작하기
source: Login with Kakao
ja: Kakaoで始める
ko: 카카오로 시작하기

# 탈퇴 시 모든 운동 기록과 데이터가 삭제되며, 복구할 수 없습니다.
source: All workout records and data will be deleted and cannot be recovered.
ja: 退会するとすべての運動記録とデータが削除され、復元できません。
ko: 탈퇴 시 모든 운동 기록과 데이터가 삭제되며, 복구할 수 없습니다.

# 편집
source: Edit
ja: 編集
ko: 편집

# 한글, 영문 2~8자
source: 2–8 Korean or English characters
ja: 韓国語・英語2～8文字
ko: 한글, 영문 2~8자

# 현재 설정된 휴식 시간
source: Current Rest Time
ja: 現在設定されている休憩時間
ko: 현재 설정된 휴식 시간

# 현재 운동 목록
source: Current Exercises
ja: 現在の運動リスト
ko: 현재 운동 목록

# 현재 운동 인덱스
source: Current Exercise Index
ja: 現在の運動インデックス
ko: 현재 운동 인덱스

# 현재 저장된 운동 항목이 없습니다.
source: No saved workout items.
ja: 現在保存されている運動項目はありません。
ko: 현재 저장된 운동 항목이 없습니다.

# 현재 저장된 운동 항목이 없어요.
source: No saved workout items.
ja: 現在保存されている運動項目はありません。
ko: 현재 저장된 운동 항목이 없어요.

# 확인
source: Confirm
ja: 確認
ko: 확인

# 회
source: reps
ja: 回
ko: 회

# 휴식
source: Rest
ja: 休憩
ko: 휴식

# 휴식 시간 있을 시 휴식 스킵 / 휴식 시간 0일시 세트 스킵
source: Skip rest if there is rest time / Skip set if rest time is 0
ja: 休憩時間があれば休憩をスキップ／休憩時間が0ならセットをスキップ
ko: 휴식 시간 있을 시 휴식 스킵 / 휴식 시간 0일시 세트 스킵

# 휴식 시간을 미리 설정해보세요
source: Set your rest time in advance
ja: 休憩時間を事前に設定しましょう
ko: 휴식 시간을 미리 설정해보세요

# 휴식 종료!
source: Rest Finished!
ja: 休憩終了！
ko: 휴식 종료!

# 휴식 중지 및 재개 버튼
source: Pause and resume rest button
ja: 休憩の一時停止・再開ボタン
ko: 휴식 중지 및 재개 버튼

# 휴식 중지 재개
source: Pause/Resume Rest
ja: 休憩の一時停止・再開
ko: 휴식 중지 재개

# 휴식 타이머를 확인하고,
source: Check your rest timer,
ja: 休憩タイマーを確認して
ko: 휴식 타이머를 확인하고,
